app/Views/layout/header.php

$userCoins = 0;
if ($loggedIn) {
    $db = \Config\Database::connect();
    $row = $db->table('users')->select('coin_balance')->where('id', session()->get('user_id'))->get()->getRowArray();
---
SELECT `coin_balance`
FROM `users`
WHERE `id` = '1'