app/Controllers/Admin.php

    public function index()
    {
        $db = \Config\Database::connect();

        $stats = [
            'total_users'           => $db->table('users')->countAllResults(),
            'total_recipes'         => $db->table('recipes')->where('status','published')->countAllResults(),
            'total_chef_verified'   => $db->table('users')->where('role','CHEF_VERIFIED')->countAllResults(),
            'total_chef_unverified' => $db->table('users')->where('role','CHEF_UNVERIFIED')->countAllResults(),
            'pending_verifications' => $db->table('chef_verifications')->where('status','pending')->countAllResults(),
            'total_unlocks'         => $db->table('recipe_unlocks')->countAllResults(),
            // Platform revenue = semua platform_earn dari unlock
            'platform_coins'        => (int)($db->table('recipe_unlocks')->selectSum('platform_earn')->get()->getRowArray()['platform_earn'] ?? 0),
            // Total koin beredar = sum topup yang paid
            'coins_circulating'     => (int)($db->table('coin_topups')->where('status','paid')->selectSum('coin_amount')->get()->getRowArray()['coin_amount'] ?? 0),
        ];

        $recentUnlocks = $db->table('recipe_unlocks')
            ->select('recipe_unlocks.*, recipes.title as recipe_title, u1.name as buyer_name, u2.name as chef_name')
            ->join('recipes', 'recipes.id = recipe_unlocks.recipe_id')
            ->join('users u1', 'u1.id = recipe_unlocks.user_id')
            ->join('users u2', 'u2.id = recipes.chef_id')
            ->orderBy('recipe_unlocks.created_at', 'DESC')
            ->limit(8)
            ->get()->getResultArray();

        $recentUsers = $this->userModel->orderBy('created_at','DESC')->findAll(5);
---
SELECT COUNT(*) AS `numrows`
FROM `recipes`
WHERE `status` = 'published'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'CHEF_VERIFIED'
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `role` = 'CHEF_UNVERIFIED'
SELECT COUNT(*) AS `numrows`
FROM `chef_verifications`
WHERE `status` = 'pending'
SELECT COUNT(*) AS `numrows`
FROM `users`
SELECT COUNT(*) AS `numrows`
FROM `recipe_unlocks`
SELECT SUM(`platform_earn`) AS `platform_earn`
FROM `recipe_unlocks`
SELECT SUM(`coin_amount`) AS `coin_amount`
FROM `coin_topups`
WHERE `status` = 'paid'
SELECT `recipe_unlocks`.*, `recipes`.`title` as `recipe_title`, `u1`.`name` as `buyer_name`, `u2`.`name` as `chef_name`
FROM `recipe_unlocks`
JOIN `recipes` ON `recipes`.`id` = `recipe_unlocks`.`recipe_id`
JOIN `users` `u1` ON `u1`.`id` = `recipe_unlocks`.`user_id`
JOIN `users` `u2` ON `u2`.`id` = `recipes`.`chef_id`
ORDER BY `recipe_unlocks`.`created_at` DESC
 LIMIT 8
SELECT *
FROM `users`
ORDER BY `created_at` DESC
 LIMIT 5

    public function verifications()
    {
        $type   = $this->request->getGet('type') ?? 'all';
        $status = $this->request->getGet('status') ?? 'pending';

        $db = \Config\Database::connect();
        $builder = $db->table('chef_verifications')
            ->select('chef_verifications.*, users.name as user_name, users.email as user_email, users.role as user_role')
            ->join('users', 'users.id = chef_verifications.user_id');

        if ($type !== 'all') $builder->where('chef_verifications.verification_type', $type);
        if ($status !== 'all') $builder->where('chef_verifications.status', $status);

        $verifications = $builder->orderBy('chef_verifications.created_at', 'DESC')->get()->getResultArray();
---
SELECT `chef_verifications`.*, `users`.`name` as `user_name`, `users`.`email` as `user_email`, `users`.`role` as `user_role`
FROM `chef_verifications`
JOIN `users` ON `users`.`id` = `chef_verifications`.`user_id`
WHERE `chef_verifications`.`status` = 'pending'
ORDER BY `chef_verifications`.`created_at` DESC

    public function users()
    {
        $search = $this->request->getGet('search');
        $role   = $this->request->getGet('role');
        $db     = \Config\Database::connect();
        $builder = $db->table('users');
        if (!empty($search)) $builder->groupStart()->like('name', $search)->orLike('email', $search)->groupEnd();
        if (!empty($role)) $builder->where('role', $role);
        $users = $builder->orderBy('created_at','DESC')->get()->getResultArray();

        foreach ($users as &$u) {
            $u['recipe_count']  = $db->table('recipes')->where('chef_id', $u['id'])->countAllResults();
            $u['unlock_count']  = $db->table('recipe_unlocks')->where('user_id', $u['id'])->countAllResults();
---
SELECT *
FROM `users`
ORDER BY `created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `recipes`
WHERE `chef_id` = '55'
SELECT COUNT(*) AS `numrows`
FROM `recipe_unlocks`
WHERE `user_id` = '55'

    public function recipes()
    {
        $db = \Config\Database::connect();
        $builder = $db->table('recipes')
            ->select('recipes.*, users.name as chef_name, users.role as chef_role')
            ->join('users', 'users.id = recipes.chef_id');
        $search = $this->request->getGet('search');
        $status = $this->request->getGet('status');
        if (!empty($search)) $builder->groupStart()->like('recipes.title', $search)->orLike('users.name', $search)->groupEnd();
        if (!empty($status)) $builder->where('recipes.status', $status);
        $recipes = $builder->orderBy('recipes.created_at','DESC')->get()->getResultArray();
        foreach ($recipes as &$r) {
            $r['unlock_count'] = $db->table('recipe_unlocks')->where('recipe_id', $r['id'])->countAllResults();
        }
        $chefs = $db->table('users')->whereIn('role',['CHEF_VERIFIED','CHEF_UNVERIFIED'])->orderBy('name','ASC')->get()->getResultArray();
---
SELECT `recipes`.*, `users`.`name` as `chef_name`, `users`.`role` as `chef_role`
FROM `recipes`
JOIN `users` ON `users`.`id` = `recipes`.`chef_id`
ORDER BY `recipes`.`created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `recipe_unlocks`
WHERE `recipe_id` = '1'
SELECT *
FROM `users`
WHERE `role` IN ('CHEF_VERIFIED','CHEF_UNVERIFIED')
ORDER BY `name` ASC

    public function recipeToggleStatus($id = null, $newStatus = null)
    {
        $id = (int) $id;
        if (!in_array($newStatus, ['published','draft','archived'])) return redirect()->back()->with('error', 'Status tidak valid');
        $recipe = $this->recipeModel->find($id);
        if (!$recipe) return redirect()->back()->with('error', 'Resep tidak ditemukan');
        $this->recipeModel->update($id, ['status' => $newStatus]);
---
SELECT *
FROM `recipes`
WHERE `recipes`.`id` = 1
UPDATE `recipes` SET `status` = 'draft', `updated_at` = '2026-07-09 15:28:53'
WHERE `recipes`.`id` IN (1)