app/Controllers/Chef.php

    public function dashboard()
    {
        $userId = session()->get('user_id');
        $status = $this->request->getGet('status') ?? 'all';

        $recipes    = $this->recipeModel->getRecipesByChef($userId, $status);
        $allRecipes = $this->recipeModel->getRecipesByChef($userId, 'all');
        $user       = $this->userModel->find($userId);
---
SELECT *
FROM `users`
WHERE `users`.`id` = '1'