app/Controllers/Coin.php

SELECT *
FROM `coin_transactions`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 50
SELECT *
FROM `users`
WHERE `users`.`id` = '1'
---
    public function history()
    {
        $userId = session()->get('user_id');
        $db     = \Config\Database::connect();

        $transactions = $db->table('coin_transactions')
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit(50)
            ->get()->getResultArray();

        $user = $this->userModel->find($userId);