app/Controllers/Recipe.php

    public function detail($slug = null)
    {
        if (empty($slug)) return redirect()->to('/recipes');

        $recipe = $this->recipeModel
            ->select('recipes.*, users.name as chef_name, users.avatar as chef_avatar, users.bio as chef_bio, users.role as chef_role')
            ->join('users', 'users.id = recipes.chef_id')
            ->where('recipes.slug', $slug)
            ->where('recipes.status', 'published')
            ->first();
---
SELECT `recipes`.*, `users`.`name` as `chef_name`, `users`.`avatar` as `chef_avatar`, `users`.`bio` as `chef_bio`, `users`.`role` as `chef_role`
FROM `recipes`
JOIN `users` ON `users`.`id` = `recipes`.`chef_id`
WHERE `recipes`.`slug` = 'nasi-goreng-kampung'
AND `recipes`.`status` = 'published'
 LIMIT 1