app/Controllers/User.php

    public function dashboard()
    {
        helper('cookpad');
        $userId = session()->get('user_id');
        $userModel  = new UserModel();
        $unlockModel = new RecipeUnlockModel();

        $user = $userModel->getWithStats($userId);
        if (!$user) return redirect()->to('/login');

        $unlockedRecipes = $unlockModel->getUnlockedByUser($userId);

        $db = \Config\Database::connect();
        $recentTransactions = $db->table('coin_transactions')
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->limit(5)
            ->get()->getResultArray();
---
SELECT *
FROM `coin_transactions`
WHERE `user_id` = '1'
ORDER BY `created_at` DESC
 LIMIT 5