app/Models/RecipeUnlockModel.php

    public function getUnlockedByUser(int $userId): array
    {
        $db = \Config\Database::connect();
        return $db->table('recipe_unlocks')
            ->select('recipe_unlocks.*, recipes.title, recipes.slug, recipes.image, recipes.cuisine')
            ->join('recipes', 'recipes.id = recipe_unlocks.recipe_id')
            ->where('recipe_unlocks.user_id', $userId)
            ->orderBy('recipe_unlocks.created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT `recipe_unlocks`.*, `recipes`.`title`, `recipes`.`slug`, `recipes`.`image`, `recipes`.`cuisine`
FROM `recipe_unlocks`
JOIN `recipes` ON `recipes`.`id` = `recipe_unlocks`.`recipe_id`
WHERE `recipe_unlocks`.`user_id` = 1
ORDER BY `recipe_unlocks`.`created_at` DESC

    public function totalEarnedByChef(int $chefId): int
    {
        $db = \Config\Database::connect();
        $row = $db->table('recipe_unlocks')
            ->selectSum('chef_earn')
            ->join('recipes', 'recipes.id = recipe_unlocks.recipe_id')
            ->where('recipes.chef_id', $chefId)
            ->get()->getRowArray();
---
SELECT SUM(`chef_earn`) AS `chef_earn`
FROM `recipe_unlocks`
JOIN `recipes` ON `recipes`.`id` = `recipe_unlocks`.`recipe_id`
WHERE `recipes`.`chef_id` = 1