app/Models/RecipeModel.php

SELECT `recipes`.*, `users`.`name` as `chef_name`, `users`.`avatar` as `chef_avatar`
FROM `recipes`
JOIN `users` ON `users`.`id` = `recipes`.`chef_id`
WHERE `recipes`.`id` = 2
SELECT *
FROM `ingredients`
WHERE `recipe_id` = 2
ORDER BY `sort_order` ASC
SELECT *
FROM `steps`
WHERE `recipe_id` = 2
ORDER BY `sort_order` ASC
SELECT COUNT(*) AS `numrows`
FROM `bookmarks`
WHERE `recipe_id` = 2
---
    public function getWithDetails(int $id): ?array
    {
        $db = \Config\Database::connect();

        $recipe = $db->table('recipes')
            ->select('recipes.*, users.name as chef_name, users.avatar as chef_avatar')
            ->join('users', 'users.id = recipes.chef_id')
            ->where('recipes.id', $id)
            ->get()->getRowArray();

        if (!$recipe) return null;

        $recipe['ingredients'] = $db->table('ingredients')
            ->where('recipe_id', $id)
            ->orderBy('sort_order', 'ASC')
            ->get()->getResultArray();

        $recipe['steps'] = $db->table('steps')
            ->where('recipe_id', $id)
            ->orderBy('sort_order', 'ASC')
            ->get()->getResultArray();

        $recipe['bookmark_count'] = $db->table('bookmarks')
            ->where('recipe_id', $id)
            ->countAllResults();

SELECT `recipes`.*, `users`.`name` as `chef_name`, `users`.`avatar` as `chef_avatar`
FROM `recipes`
JOIN `users` ON `users`.`id` = `recipes`.`chef_id`
WHERE `recipes`.`status` = 'published'
ORDER BY `recipes`.`created_at` DESC
SELECT COUNT(*) AS `numrows`
FROM `bookmarks`
WHERE `recipe_id` = '2'
---
    public function getFiltered(array $filters = []): array
    {
        $db = \Config\Database::connect();

        $builder = $db->table('recipes')
            ->select('recipes.*, users.name as chef_name, users.avatar as chef_avatar')
            ->join('users', 'users.id = recipes.chef_id')
            ->where('recipes.status', 'published');

        if (!empty($filters['cuisine']))   $builder->where('recipes.cuisine', $filters['cuisine']);
        if (!empty($filters['category']))  $builder->where('recipes.category', $filters['category']);
        if (!empty($filters['difficulty'])) $builder->where('recipes.difficulty', $filters['difficulty']);
        if (!empty($filters['search'])) {
            $builder->groupStart()
                ->like('recipes.title', $filters['search'])
                ->orLike('recipes.description', $filters['search'])
                ->groupEnd();
        }
        if (isset($filters['is_premium']) && $filters['is_premium'] !== '') {
            $builder->where('recipes.is_premium', (int) $filters['is_premium']);
        }

        $builder->orderBy('recipes.created_at', 'DESC');
        $recipes = $builder->get()->getResultArray();

        foreach ($recipes as &$recipe) {
            $recipe['bookmark_count'] = $db->table('bookmarks')
                ->where('recipe_id', $recipe['id'])
                ->countAllResults();

SELECT `recipes`.*, `users`.`name` as `chef_name`, `users`.`avatar` as `chef_avatar`
FROM `recipes`
JOIN `users` ON `users`.`id` = `recipes`.`chef_id`
WHERE `recipes`.`chef_id` = 1
ORDER BY `recipes`.`created_at` DESC
---
    public function getRecipesByChef(int $chefId, ?string $statusFilter = null): array
    {
        $db = \Config\Database::connect();

        $builder = $db->table('recipes')
            ->select('recipes.*, users.name as chef_name, users.avatar as chef_avatar')
            ->join('users', 'users.id = recipes.chef_id')
            ->where('recipes.chef_id', $chefId);

        // Filter by status: 'all' atau null → semua, selain itu filter spesifik
        if ($statusFilter && $statusFilter !== 'all') {
            $builder->where('recipes.status', $statusFilter);
        }

        $builder->orderBy('recipes.created_at', 'DESC');
        $recipes = $builder->get()->getResultArray();