app/Models/UserModel.php

    public function getWithStats(int $userId): ?array
    {
        $user = $this->find($userId);
        if (!$user) return null;

        $db = \Config\Database::connect();
        $user['recipe_count']   = $db->table('recipes')->where('chef_id', $userId)->countAllResults();
        $user['unlock_count']   = $db->table('recipe_unlocks')->where('user_id', $userId)->countAllResults();
        $user['bookmark_count'] = $db->table('bookmarks')->where('user_id', $userId)->countAllResults();

        // Koin yang dihasilkan chef dari resep
        $earnRow = $db->table('recipe_unlocks')
            ->selectSum('chef_earn')
            ->join('recipes', 'recipes.id = recipe_unlocks.recipe_id')
            ->where('recipes.chef_id', $userId)
            ->get()->getRowArray();
        $user['total_earned'] = (int)($earnRow['chef_earn'] ?? 0);

        // Verifikasi chef
        $user['verifications'] = $db->table('chef_verifications')
            ->where('user_id', $userId)
            ->orderBy('created_at', 'DESC')
            ->get()->getResultArray();
---
SELECT *
FROM `users`
WHERE `users`.`id` = 1
SELECT COUNT(*) AS `numrows`
FROM `recipes`
WHERE `chef_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `recipe_unlocks`
WHERE `user_id` = 1
SELECT COUNT(*) AS `numrows`
FROM `bookmarks`
WHERE `user_id` = 1
SELECT SUM(`chef_earn`) AS `chef_earn`
FROM `recipe_unlocks`
JOIN `recipes` ON `recipes`.`id` = `recipe_unlocks`.`recipe_id`
WHERE `recipes`.`chef_id` = 1
SELECT *
FROM `chef_verifications`
WHERE `user_id` = 1
ORDER BY `created_at` DESC